pg_bench/postgresql_oltp_update_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 prepare >> postgresql_oltp_update_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Creating table 'sbtest4'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest3'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 run >> postgresql_oltp_update_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 9989.84 qps: 9989.84 (r/w/o: 0.00/9989.84/0.00) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 10878.37 qps: 10878.37 (r/w/o: 0.00/10878.37/0.00) lat (ms,95%): 1.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 12204.13 qps: 12204.13 (r/w/o: 0.00/12204.13/0.00) lat (ms,95%): 0.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 10945.23 qps: 10945.23 (r/w/o: 0.00/10945.23/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 10004.35 qps: 10004.35 (r/w/o: 0.00/10004.35/0.00) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 9932.65 qps: 9932.65 (r/w/o: 0.00/9932.65/0.00) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           639565
        other:                           0
        total:                           639565
    transactions:                        639565 (10656.40 per sec.)
    queries:                             639565 (10656.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0157s
    total number of events:              639565

Latency (ms):
         min:                                    0.24
         avg:                                    0.75
         max:                                  181.36
         95th percentile:                        1.06
         sum:                               479411.74

Threads fairness:
    events (avg/stddev):           79945.6250/55.17
    execution time (avg/stddev):   59.9265/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 cleanup>> postgresql_oltp_update_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...