pg_bench/postgresql_oltp_update_non_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_non_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> postgresql_oltp_update_non_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest2'...
Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest1'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_non_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> postgresql_oltp_update_non_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 12900.86 qps: 12900.86 (r/w/o: 0.00/12900.86/0.00) lat (ms,95%): 0.90 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 13626.21 qps: 13626.21 (r/w/o: 0.00/13626.21/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 13854.62 qps: 13854.62 (r/w/o: 0.00/13854.62/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 13800.89 qps: 13800.89 (r/w/o: 0.00/13800.89/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 13044.83 qps: 13044.83 (r/w/o: 0.00/13044.83/0.00) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 11922.47 qps: 11922.47 (r/w/o: 0.00/11922.47/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           791563
        other:                           0
        total:                           791563
    transactions:                        791563 (13189.61 per sec.)
    queries:                             791563 (13189.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0132s
    total number of events:              791563

Latency (ms):
         min:                                    0.26
         avg:                                    0.61
         max:                                  171.63
         95th percentile:                        0.86
         sum:                               479406.96

Threads fairness:
    events (avg/stddev):           98945.3750/38.44
    execution time (avg/stddev):   59.9259/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> postgresql_oltp_update_non_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...