pg_bench/postgresql_oltp_update_non_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_non_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 prepare >> postgresql_oltp_update_non_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest4'...
Creating table 'sbtest3'...
Creating table 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest2'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_non_index --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 run >> postgresql_oltp_update_non_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 10268.21 qps: 10268.21 (r/w/o: 0.00/10268.21/0.00) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 11832.10 qps: 11832.10 (r/w/o: 0.00/11832.10/0.00) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 12983.92 qps: 12983.92 (r/w/o: 0.00/12983.92/0.00) lat (ms,95%): 0.87 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 13033.25 qps: 13033.25 (r/w/o: 0.00/13033.25/0.00) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 11067.91 qps: 11067.91 (r/w/o: 0.00/11067.91/0.00) lat (ms,95%): 1.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 10057.65 qps: 10057.65 (r/w/o: 0.00/10057.65/0.00) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           692506
        other:                           0
        total:                           692506
    transactions:                        692506 (11538.34 per sec.)
    queries:                             692506 (11538.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0169s
    total number of events:              692506

Latency (ms):
         min:                                    0.27
         avg:                                    0.69
         max:                                  158.14
         95th percentile:                        1.03
         sum:                               479399.51

Threads fairness:
    events (avg/stddev):           86563.2500/99.59
    execution time (avg/stddev):   59.9249/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 cleanup>> postgresql_oltp_update_non_index_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...